### 1. pd.date_range(), pd.Timestamp()?  
### 2. 0.5간격으로 난수 생성하는 방법  
### 3. category형을 사용해야 하는 이유?

In [1]:
import numpy as np
import pandas as pd
from IPython.display import display

### 실습 #1. Series 연습
1. 10명의 점수를 series로 생성 (점수 범위: 0~100), 인덱스는 1번부터 순차로 부여
2. 1번부터 3번까지 추출
3. 평균, 최대, 최소값 확인
4. 평균보다 작은 점수만 추출
5. 점수가 큰순서로 정렬

In [2]:
print("1.\n")
data=np.random.randint(0,101, size=10)
s=pd.Series(data, index=[1,2,3,4,5,6,7,8,9,10])
display("s=",s)
print("2.\n")
display("s[1:4]=",s[0:3])
print("3.\n")
print("s.mean={}\ns.max={}\ns.min={}".format(s.mean(),s.max(),s.min()))
print("4.\n")
display("s[s<s.mean()]=",s[s<s.mean()])
print("5.\n")
display("descending s=",s.sort_values(ascending=False))

1.

's='

1     98
2     41
3     79
4     77
5     12
6     26
7      3
8      9
9     67
10    47
dtype: int32

2.

's[1:4]='

1    98
2    41
3    79
dtype: int32

3.

s.mean=45.9
s.max=98
s.min=3
4.

's[s<s.mean()]='

2    41
5    12
6    26
7     3
8     9
dtype: int32

5.

'descending s='

1     98
3     79
4     77
9     67
10    47
2     41
6     26
5     12
8      9
7      3
dtype: int32

### 실습 #2. 데이터프레임 생성 연습

1) 5명의 성적 데이터 생성 (성명, 입학년도, 학점(0~4.5), 성별(M,F))  
열 : Name, Adyear, grade, sex    
행인덱스 : 순번   
2) 인덱스, 칼럼, 값들, 데이터타입 확인  
3)통계요약 확인  
4)성명순으로 정렬

In [3]:
print("1)\n")
df=pd.DataFrame({'Name':pd.Categorical(["Kim","Park","Lee","Choi","Hong"]),
               'Adyear':np.array([2017,2019,2016,2018,2015]),
               'Grade':pd.Series([3.5, 2.5, 3.0, 4.5, 4.0]),
               'Sex':pd.Categorical(["M", "F", "F", "M", "F"])})
display(df)
print("2)\n")
print("df.index=",df.index)
print("df.columns=",df.columns)
print("df.values=",df.values)
print("df.dtypes=",df.dtypes)
print("3)\n")
print("df.describe=",df.describe())
print("4)\n")
display(df.sort_values(by='Name'))

1)

   Name  Adyear  Grade Sex
0   Kim    2017    3.5   M
1  Park    2019    2.5   F
2   Lee    2016    3.0   F
3  Choi    2018    4.5   M
4  Hong    2015    4.0   F

2)

df.index= RangeIndex(start=0, stop=5, step=1)
df.columns= Index(['Name', 'Adyear', 'Grade', 'Sex'], dtype='object')
df.values= [['Kim' 2017 3.5 'M']
 ['Park' 2019 2.5 'F']
 ['Lee' 2016 3.0 'F']
 ['Choi' 2018 4.5 'M']
 ['Hong' 2015 4.0 'F']]
df.dtypes= Name      category
Adyear       int32
Grade      float64
Sex       category
dtype: object
3)

df.describe=             Adyear     Grade
count     5.000000  5.000000
mean   2017.000000  3.500000
std       1.581139  0.790569
min    2015.000000  2.500000
25%    2016.000000  3.000000
50%    2017.000000  3.500000
75%    2018.000000  4.000000
max    2019.000000  4.500000
4)

   Name  Adyear  Grade Sex
3  Choi    2018    4.5   M
4  Hong    2015    4.0   F
0   Kim    2017    3.5   M
2   Lee    2016    3.0   F
1  Park    2019    2.5   F

### 실습 3. 데이터프레임 인덱싱 연습

5명의 성적 데이터 이용   
1)성명만 추출  
2)입학년도와 성적만 추출  
3)성명이 'kim'인 데이터만 추출  
4)입학년도가 2018년도 이상만 추출  
5)여성만 추출  
6)여성이면서 입학년도가 2019년도만 추출
7)성적이 3.5이상이거나 남성인 경우 추출

In [4]:
print("1)\n")
display(df['Name'])
print("2)\n")
display(df.loc[:,'Adyear':'Grade'])
print("3)\n")
grouped=df.groupby('Name')
display(grouped.get_group(name='Kim'))
print("4)\n")
year=df['Adyear']>=2018
display(df[year])
print("5)\n")
grouped=df.groupby('Sex')
display(grouped.get_group(name='F'))
print("6)\n")
tyear=df['Adyear']==2019
grouped=df[tyear].groupby('Sex')
display(grouped.get_group(name='F'))
print("7)\n")
g=df['Grade']>=3.5
grouped=df[g].groupby('Sex')
display(grouped.get_group(name='M'))

1)

0     Kim
1    Park
2     Lee
3    Choi
4    Hong
Name: Name, dtype: category
Categories (5, object): [Choi, Hong, Kim, Lee, Park]

2)

   Adyear  Grade
0    2017    3.5
1    2019    2.5
2    2016    3.0
3    2018    4.5
4    2015    4.0

3)

  Name  Adyear  Grade Sex
0  Kim    2017    3.5   M

4)

   Name  Adyear  Grade Sex
1  Park    2019    2.5   F
3  Choi    2018    4.5   M

5)

   Name  Adyear  Grade Sex
1  Park    2019    2.5   F
2   Lee    2016    3.0   F
4  Hong    2015    4.0   F

6)

   Name  Adyear  Grade Sex
1  Park    2019    2.5   F

7)

   Name  Adyear  Grade Sex
0   Kim    2017    3.5   M
3  Choi    2018    4.5   M